//============================================================================
/*
@TODO:


*/
//============================================================================

// некоторые команды
/*
 * TASKLIST /FI "USERNAME NE NT AUTORITY\SYSTEM" /FI "STATUS eq running" /FO CSV /NH > process_list
   TASKKILL /IM Process_log.exe

   $ date
   25 окт 2013 г.  1:17:29

 */
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////



#include "Process_log_main.h"


void GetProcessList() {

    // смена кодировки
	system("chcp 1251");

	system(tasklist);

}


void Initialization(){
	// точно знаю что нужно первым делом проверить на существование другой версии
	// первый раз пооткрываать файлы
	// вызвать GetProcessList
	//

}

void Timer(int time){
	Sleep(time);  // winAPI

}

void CheckProcess(){
	// пошло поехала работа с классами и т.д.
	// Отсюда тоже пару доп ф-ций получится -> собственно основная и самая напряжная ф-ция...под конец её
	// но надо будет пару тестиков намутить для всего этого
}

void HideWindow(){
	//скрываю окно - хотя с другой стороны нужно придумать как по хитрому потом просматривать результаты
    HWND hWnd = GetConsoleWindow(); // так не делать скрытым, а сворачивать в трее
    ShowWindow(hWnd, SW_HIDE);
}


///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////

int main(int argc, char *argv[]) {

	int time = 3*1000; // 3sec
	//time = atoi(argv[1]);

	Initialization();

	while(1){
		// будем работать в бесконечном цикле

		Timer(time);
		CheckProcess();

		// ...
	}

	return 0;
}



////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// просто так..вдруг понадобится
/*
char *AppTitle="Win1";
LRESULT CALLBACK WindowProc(HWND hwnd, UINT msg, WPARAM wparam, LPARAM lparam);

int WinMain(HINSTANCE,HINSTANCE,LPSTR,int)
{
  MessageBox(0,"Hello, Windows","MinGW Test Program",MB_OK);
  return 0;
}
*/
