//============================================================================
/*
@TODO:


*/
//============================================================================

// некоторые команды
/*
 * TASKLIST /FI "USERNAME NE NT AUTORITY\SYSTEM" /FI "STATUS eq running" /FO CSV /NH > process_list
   TASKKILL /IM Process_log.exe
 */
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////



#include "Process_log_main.h"


void GetProcessList() {

	//скрываю окно - хотя с другой стороны нужно придумать как по хитрому потом просматривать результаты
    HWND hWnd = GetConsoleWindow();
    ShowWindow(hWnd, SW_HIDE);

    // смена кодировки
	//system("chcp 1251");

   // Пихнул пока в дефайн...потом исправлю
	system(tasklist);

}


void Initialization(){
	// точно знаю что нужно первым делом проверить на существование другой версии
	// первый раз пооткрываать файлы
	// вызвать GetProcessList
	//

}

void Timer(){
	// что-то что будет тормозить бесконечный цикл на определённые промежутки

}

void CheckProcess(){
	// пошло поехала работа с классами и т.д.
	// Отсюда тоже пару доп ф-ций получится -> собственно основная и самая напряжная ф-ция...под конец её
	// но надо будет пару тестиков намутить для всего этого
}


///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////

int main() {

	Initialization();

	while(1){
		// будем работать в бесконечном цикле

		Timer();
		CheckProcess();

		// ...
	}

	return 0;
}



////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// просто так..в друг понадобится
/*
char *AppTitle="Win1";
LRESULT CALLBACK WindowProc(HWND hwnd, UINT msg, WPARAM wparam, LPARAM lparam);

int WinMain(HINSTANCE,HINSTANCE,LPSTR,int)
{
  MessageBox(0,"Hello, Windows","MinGW Test Program",MB_OK);
  return 0;
}
*/
